In [1]:
import pandas as pd
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis="columns",inplace=True)
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [3]:
target=df.Survived
inputs=df.drop(["Survived"],axis="columns")

In [4]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [5]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [6]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [7]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [8]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [9]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [10]:
len(x_train)

712

In [11]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [12]:
model.fit(x_train,y_train)

GaussianNB()

In [13]:
model.score(x_test,y_test)

0.8044692737430168

In [14]:
x_test[:10]

     Pclass   Age      Fare  female  male
192       3  19.0    7.8542       1     0
226       2  19.0   10.5000       0     1
353       3  25.0   17.8000       0     1
394       3  24.0   16.7000       1     0
796       1  49.0   25.9292       1     0
677       3  18.0    9.8417       1     0
145       2  19.0   36.7500       0     1
480       3   9.0   46.9000       0     1
118       1  24.0  247.5208       0     1
661       3  40.0    7.2250       0     1

In [15]:
y_test[:10]

192    1
226    1
353    0
394    1
796    1
677    1
145    0
480    0
118    0
661    0
Name: Survived, dtype: int64

In [16]:
model.predict(x_test[:10])

array([1, 0, 0, 1, 1, 1, 0, 0, 1, 0], dtype=int64)

In [17]:
model.predict_proba(x_test[:10])

array([[1.07565822e-01, 8.92434178e-01],
       [9.75205514e-01, 2.47944857e-02],
       [9.90481665e-01, 9.51833536e-03],
       [1.20326312e-01, 8.79673688e-01],
       [1.35874908e-02, 9.86412509e-01],
       [1.06064942e-01, 8.93935058e-01],
       [9.69967954e-01, 3.00320462e-02],
       [9.77205293e-01, 2.27947072e-02],
       [9.88136403e-10, 9.99999999e-01],
       [9.90949730e-01, 9.05027035e-03]])